analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/ctb_regs.h
/**@} end of group CTB_SCA_RES_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_OP_BUFF_ADDR CTB_SCA_OP_BUFF_ADDR
 * @brief    SCA Operation Buffer Address Register.
 * @{
 */
#define MXC_F_CTB_SCA_OP_BUFF_ADDR_ADDR_POS            0 /**< SCA_OP_BUFF_ADDR_ADDR Position */
#define MXC_F_CTB_SCA_OP_BUFF_ADDR_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_OP_BUFF_ADDR_ADDR_POS)) /**< SCA_OP_BUFF_ADDR_ADDR Mask */

/**@} end of group CTB_SCA_OP_BUFF_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_MODDATA CTB_SCA_MODDATA
 * @brief    SCA Modulo Data Input Register.
 * @{
 */
#define MXC_F_CTB_SCA_MODDATA_DATA_POS                 0 /**< SCA_MODDATA_DATA Position */
#define MXC_F_CTB_SCA_MODDATA_DATA                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_MODDATA_DATA_POS)) /**< SCA_MODDATA_DATA Mask */

/**@} end of group CTB_SCA_MODDATA_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_NRNG CTB_SCA_NRNG
 * @brief    SCA NIST RNG Address Register.
 * @{
 */
#define MXC_F_CTB_SCA_NRNG_ADDR_POS                    0 /**< SCA_NRNG_ADDR Position */
#define MXC_F_CTB_SCA_NRNG_ADDR                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_NRNG_ADDR_POS)) /**< SCA_NRNG_ADDR Mask */

/**@} end of group CTB_SCA_NRNG_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_WASH CTB_SCA_WASH
 * @brief    SCA Wash Register.
 * @{
 */
#define MXC_F_CTB_SCA_WASH_ADDR_POS                    0 /**< SCA_WASH_ADDR Position */
#define MXC_F_CTB_SCA_WASH_ADDR                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_WASH_ADDR_POS)) /**< SCA_WASH_ADDR Mask */

/**@} end of group CTB_SCA_WASH_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_CTB_REGS_H_
